lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
xiao_nrf54l15.menu.clean_zigbee_channel.ch25=25
xiao_nrf54l15.menu.clean_zigbee_channel.ch25.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=25

xiao_nrf54l15.menu.clean_zigbee_pan.pan1234=0x1234 (Default)
xiao_nrf54l15.menu.clean_zigbee_pan.pan1234.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0x1234

xiao_nrf54l15.menu.clean_zigbee_pan.pan1a2b=0x1A2B
xiao_nrf54l15.menu.clean_zigbee_pan.pan1a2b.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0x1A2B

xiao_nrf54l15.menu.clean_zigbee_pan.panbeef=0xBEEF
xiao_nrf54l15.menu.clean_zigbee_pan.panbeef.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0xBEEF

xiao_nrf54l15.menu.clean_thread.off=Disabled (Default)
xiao_nrf54l15.menu.clean_thread.off.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=0 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
xiao_nrf54l15.menu.clean_thread.off.build.thread_seam_flags=
xiao_nrf54l15.menu.clean_thread.off.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

xiao_nrf54l15.menu.clean_thread.stage=Experimental Stage Core (Leader/Child/Router + UDP)
xiao_nrf54l15.menu.clean_thread.stage.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=1 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
xiao_nrf54l15.menu.clean_thread.stage.build.thread_seam_flags=-DOPENTHREAD_CONFIG_CORE_USER_CONFIG_HEADER_ENABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/include
xiao_nrf54l15.menu.clean_thread.stage.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

xiao_nrf54l15.menu.clean_antenna.ceramic=On-board Ceramic (Default)
xiao_nrf54l15.menu.clean_antenna.ceramic.build.antenna_flags=

xiao_nrf54l15.menu.clean_antenna.external=External U.FL
xiao_nrf54l15.menu.clean_antenna.external.build.antenna_flags=-DNRF54L15_CLEAN_ANTENNA_EXTERNAL

xiao_nrf54l15.menu.clean_upload.auto=Auto Recover (Default)
xiao_nrf54l15.menu.clean_upload.auto.upload.tool=nrf54upload
xiao_nrf54l15.menu.clean_upload.auto.upload.tool.serial=nrf54upload
xiao_nrf54l15.menu.clean_upload.auto.upload.runner=auto
xiao_nrf54l15.menu.clean_upload.auto.upload.use_1200bps_touch=false
xiao_nrf54l15.menu.clean_upload.auto.upload.wait_for_upload_port=false
xiao_nrf54l15.menu.clean_upload.auto.upload.pyocd_safe=auto

xiao_nrf54l15.menu.clean_upload.pyocd=pyOCD Recovery (CMSIS-DAP)
xiao_nrf54l15.menu.clean_upload.pyocd.upload.tool=nrf54upload
xiao_nrf54l15.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
xiao_nrf54l15.menu.clean_upload.pyocd.upload.runner=pyocd
xiao_nrf54l15.menu.clean_upload.pyocd.upload.use_1200bps_touch=false
xiao_nrf54l15.menu.clean_upload.pyocd.upload.wait_for_upload_port=false
xiao_nrf54l15.menu.clean_upload.pyocd.upload.pyocd_safe=auto

xiao_nrf54l15.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.runner=pyocd
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.wait_for_upload_port=false
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

xiao_nrf54l15.menu.clean_upload.openocd_legacy=OpenOCD Direct (Experimental)
xiao_nrf54l15.menu.clean_upload.openocd_legacy.upload.tool=nrf54openocd
xiao_nrf54l15.menu.clean_upload.openocd_legacy.upload.tool.serial=nrf54openocd
xiao_nrf54l15.menu.clean_upload.openocd_legacy.upload.runner=openocd
xiao_nrf54l15.menu.clean_upload.openocd_legacy.upload.use_1200bps_touch=false

xiao_nrf54l15.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
xiao_nrf54l15.menu.clean_upload.uf2.upload.tool=nrf54upload
xiao_nrf54l15.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
xiao_nrf54l15.menu.clean_upload.uf2.upload.protocol=uf2
xiao_nrf54l15.menu.clean_upload.uf2.upload.runner=uf2
xiao_nrf54l15.menu.clean_upload.uf2.upload.use_1200bps_touch=false
xiao_nrf54l15.menu.clean_upload.uf2.upload.wait_for_upload_port=false

holyiot_25007_nrf54l15.name=HOLYIOT-25007 nRF54L15 Module

holyiot_25007_nrf54l15.upload.tool=nrf54upload
holyiot_25007_nrf54l15.upload.tool.serial=nrf54upload
holyiot_25007_nrf54l15.upload.protocol=cmsis-dap
holyiot_25007_nrf54l15.upload.maximum_size=1556480
holyiot_25007_nrf54l15.upload.maximum_data_size=155648
holyiot_25007_nrf54l15.upload.wait_for_upload_port=false
holyiot_25007_nrf54l15.upload.use_1200bps_touch=false
holyiot_25007_nrf54l15.upload.disable_flushing=true
holyiot_25007_nrf54l15.upload.runner=pyocd
holyiot_25007_nrf54l15.upload.target=nrf54l
holyiot_25007_nrf54l15.upload.uid=
holyiot_25007_nrf54l15.upload.openocd_script={runtime.platform.path}/tools/openocd/nrf54l15.cfg
holyiot_25007_nrf54l15.upload.openocd_speed=4000
holyiot_25007_nrf54l15.upload.openocd_bin={runtime.tools.openocd-0.11.0-arduino2.path}/bin/openocd

holyiot_25007_nrf54l15.serial.disableDTR=false
holyiot_25007_nrf54l15.serial.disableRTS=false

holyiot_25007_nrf54l15.build.mcu=cortex-m33
holyiot_25007_nrf54l15.build.f_cpu=64000000L
holyiot_25007_nrf54l15.build.board=HOLYIOT_25007_NRF54L15
holyiot_25007_nrf54l15.build.core=nrf54l15
holyiot_25007_nrf54l15.build.variant=nrf54l15_module_36pin
holyiot_25007_nrf54l15.build.ldscript=nrf54l15_linker_script.ld
holyiot_25007_nrf54l15.build.uf2_family=0xADA54B15
holyiot_25007_nrf54l15.build.uf2_base_address=0x00000000
holyiot_25007_nrf54l15.build.cpu_flags=-DARDUINO_NRF54_CPU_64M
holyiot_25007_nrf54l15.build.power_flags=
holyiot_25007_nrf54l15.build.boot_flags=
holyiot_25007_nrf54l15.build.auto_gate_flags=
holyiot_25007_nrf54l15.build.security_flags=-DNRF_APPLICATION
holyiot_25007_nrf54l15.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1
holyiot_25007_nrf54l15.build.ble_tx_flags=
holyiot_25007_nrf54l15.build.ble_timing_flags=
holyiot_25007_nrf54l15.build.ble_trace_flags=
holyiot_25007_nrf54l15.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=1
holyiot_25007_nrf54l15.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=1
holyiot_25007_nrf54l15.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=15
holyiot_25007_nrf54l15.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0x1234
holyiot_25007_nrf54l15.build.antenna_flags=
holyiot_25007_nrf54l15.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER
holyiot_25007_nrf54l15.build.extra_flags=-DARDUINO_NRF54L15 -DNRF54L15_XXAA -DARDUINO_HOLYIOT_25007_NRF54L15 {build.cpu_flags} {build.power_flags} {build.boot_flags} {build.auto_gate_flags} {build.security_flags} {build.ble_flags} {build.ble_tx_flags} {build.ble_timing_flags} {build.ble_trace_flags} {build.vpr_flags} {build.zigbee_flags} {build.zigbee_channel_flags} {build.zigbee_pan_flags} {build.thread_flags} {build.thread_seam_flags} {build.thread_crypto_flags} {build.matter_flags} {build.matter_seam_flags} {build.antenna_flags} {build.serial_flags}

holyiot_25007_nrf54l15.menu.clean_cpu.cpu64=64 MHz (Default)
holyiot_25007_nrf54l15.menu.clean_cpu.cpu64.build.f_cpu=64000000L
holyiot_25007_nrf54l15.menu.clean_cpu.cpu64.build.cpu_flags=-DARDUINO_NRF54_CPU_64M

holyiot_25007_nrf54l15.menu.clean_cpu.cpu128=128 MHz (Turbo)
holyiot_25007_nrf54l15.menu.clean_cpu.cpu128.build.f_cpu=128000000L
holyiot_25007_nrf54l15.menu.clean_cpu.cpu128.build.cpu_flags=-DARDUINO_NRF54_CPU_128M

