lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
holyiot_25008_nrf54l15.menu.clean_zigbee_channel.ch15=15 (Default)
holyiot_25008_nrf54l15.menu.clean_zigbee_channel.ch15.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=15

holyiot_25008_nrf54l15.menu.clean_zigbee_channel.ch11=11
holyiot_25008_nrf54l15.menu.clean_zigbee_channel.ch11.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=11

holyiot_25008_nrf54l15.menu.clean_zigbee_channel.ch20=20
holyiot_25008_nrf54l15.menu.clean_zigbee_channel.ch20.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=20

holyiot_25008_nrf54l15.menu.clean_zigbee_channel.ch25=25
holyiot_25008_nrf54l15.menu.clean_zigbee_channel.ch25.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=25

holyiot_25008_nrf54l15.menu.clean_zigbee_pan.pan1234=0x1234 (Default)
holyiot_25008_nrf54l15.menu.clean_zigbee_pan.pan1234.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0x1234

holyiot_25008_nrf54l15.menu.clean_zigbee_pan.pan1a2b=0x1A2B
holyiot_25008_nrf54l15.menu.clean_zigbee_pan.pan1a2b.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0x1A2B

holyiot_25008_nrf54l15.menu.clean_zigbee_pan.panbeef=0xBEEF
holyiot_25008_nrf54l15.menu.clean_zigbee_pan.panbeef.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0xBEEF

holyiot_25008_nrf54l15.menu.clean_thread.off=Disabled (Default)
holyiot_25008_nrf54l15.menu.clean_thread.off.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=0 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
holyiot_25008_nrf54l15.menu.clean_thread.off.build.thread_seam_flags=
holyiot_25008_nrf54l15.menu.clean_thread.off.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

holyiot_25008_nrf54l15.menu.clean_thread.stage=Experimental Stage Core (Leader/Child/Router + UDP)
holyiot_25008_nrf54l15.menu.clean_thread.stage.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=1 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
holyiot_25008_nrf54l15.menu.clean_thread.stage.build.thread_seam_flags=-DOPENTHREAD_CONFIG_CORE_USER_CONFIG_HEADER_ENABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/include
holyiot_25008_nrf54l15.menu.clean_thread.stage.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

holyiot_25008_nrf54l15.menu.clean_serial.header=Header UART on D0/D1 (Default)
holyiot_25008_nrf54l15.menu.clean_serial.header.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER

holyiot_25008_nrf54l15.menu.clean_serial.disabled=GPIO on D0/D1 (Serial disabled)
holyiot_25008_nrf54l15.menu.clean_serial.disabled.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_DISABLED

holyiot_25008_nrf54l15.menu.clean_upload.pyocd=pyOCD (CMSIS-DAP, Default)
holyiot_25008_nrf54l15.menu.clean_upload.pyocd.upload.tool=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.pyocd.upload.runner=pyocd
holyiot_25008_nrf54l15.menu.clean_upload.pyocd.upload.use_1200bps_touch=false

holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm.upload.runner=pyocd
holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

holyiot_25008_nrf54l15.menu.clean_upload.openocd_legacy=OpenOCD Direct (Experimental)
holyiot_25008_nrf54l15.menu.clean_upload.openocd_legacy.upload.tool=nrf54openocd
holyiot_25008_nrf54l15.menu.clean_upload.openocd_legacy.upload.tool.serial=nrf54openocd
holyiot_25008_nrf54l15.menu.clean_upload.openocd_legacy.upload.runner=openocd
holyiot_25008_nrf54l15.menu.clean_upload.openocd_legacy.upload.use_1200bps_touch=false

holyiot_25008_nrf54l15.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.tool=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.protocol=uf2
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.runner=uf2
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.use_1200bps_touch=false
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.wait_for_upload_port=false

generic_nrf54l15_module_36pin.name=Generic nRF54L15 Module (36-pad)

generic_nrf54l15_module_36pin.upload.tool=nrf54upload
generic_nrf54l15_module_36pin.upload.tool.serial=nrf54upload
generic_nrf54l15_module_36pin.upload.protocol=cmsis-dap
generic_nrf54l15_module_36pin.upload.maximum_size=1556480
generic_nrf54l15_module_36pin.upload.maximum_data_size=155648
generic_nrf54l15_module_36pin.upload.wait_for_upload_port=false
generic_nrf54l15_module_36pin.upload.use_1200bps_touch=false
generic_nrf54l15_module_36pin.upload.disable_flushing=true
generic_nrf54l15_module_36pin.upload.runner=pyocd
generic_nrf54l15_module_36pin.upload.target=nrf54l
generic_nrf54l15_module_36pin.upload.uid=
generic_nrf54l15_module_36pin.upload.openocd_script={runtime.platform.path}/tools/openocd/nrf54l15.cfg
generic_nrf54l15_module_36pin.upload.openocd_speed=4000
generic_nrf54l15_module_36pin.upload.openocd_bin={runtime.tools.openocd-0.11.0-arduino2.path}/bin/openocd

generic_nrf54l15_module_36pin.serial.disableDTR=false
generic_nrf54l15_module_36pin.serial.disableRTS=false

generic_nrf54l15_module_36pin.build.mcu=cortex-m33
generic_nrf54l15_module_36pin.build.f_cpu=64000000L
generic_nrf54l15_module_36pin.build.board=GENERIC_NRF54L15_MODULE_36PIN
generic_nrf54l15_module_36pin.build.core=nrf54l15
generic_nrf54l15_module_36pin.build.variant=nrf54l15_module_36pin
generic_nrf54l15_module_36pin.build.ldscript=nrf54l15_linker_script.ld
generic_nrf54l15_module_36pin.build.uf2_family=0xADA54B15
generic_nrf54l15_module_36pin.build.uf2_base_address=0x00000000
generic_nrf54l15_module_36pin.build.cpu_flags=-DARDUINO_NRF54_CPU_64M
generic_nrf54l15_module_36pin.build.power_flags=
generic_nrf54l15_module_36pin.build.boot_flags=
generic_nrf54l15_module_36pin.build.auto_gate_flags=
generic_nrf54l15_module_36pin.build.security_flags=-DNRF_APPLICATION
generic_nrf54l15_module_36pin.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1
generic_nrf54l15_module_36pin.build.ble_tx_flags=
generic_nrf54l15_module_36pin.build.ble_timing_flags=
generic_nrf54l15_module_36pin.build.ble_trace_flags=
generic_nrf54l15_module_36pin.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=1
generic_nrf54l15_module_36pin.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=1
generic_nrf54l15_module_36pin.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=15
generic_nrf54l15_module_36pin.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0x1234
generic_nrf54l15_module_36pin.build.antenna_flags=
generic_nrf54l15_module_36pin.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER
generic_nrf54l15_module_36pin.build.extra_flags=-DARDUINO_NRF54L15 -DNRF54L15_XXAA -DARDUINO_GENERIC_NRF54L15_MODULE_36PIN {build.cpu_flags} {build.power_flags} {build.boot_flags} {build.auto_gate_flags} {build.security_flags} {build.ble_flags} {build.ble_tx_flags} {build.ble_timing_flags} {build.ble_trace_flags} {build.vpr_flags} {build.zigbee_flags} {build.zigbee_channel_flags} {build.zigbee_pan_flags} {build.thread_flags} {build.thread_seam_flags} {build.thread_crypto_flags} {build.matter_flags} {build.matter_seam_flags} {build.antenna_flags} {build.serial_flags}

generic_nrf54l15_module_36pin.menu.clean_cpu.cpu64=64 MHz (Default)
generic_nrf54l15_module_36pin.menu.clean_cpu.cpu64.build.f_cpu=64000000L
generic_nrf54l15_module_36pin.menu.clean_cpu.cpu64.build.cpu_flags=-DARDUINO_NRF54_CPU_64M

generic_nrf54l15_module_36pin.menu.clean_cpu.cpu128=128 MHz (Turbo)
generic_nrf54l15_module_36pin.menu.clean_cpu.cpu128.build.f_cpu=128000000L
generic_nrf54l15_module_36pin.menu.clean_cpu.cpu128.build.cpu_flags=-DARDUINO_NRF54_CPU_128M

generic_nrf54l15_module_36pin.menu.clean_power.balanced=Balanced (Default)
generic_nrf54l15_module_36pin.menu.clean_power.balanced.build.power_flags=

