lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
generic_nrf54l15_module_36pin.menu.clean_power.low=Low Power (WFI Idle)
generic_nrf54l15_module_36pin.menu.clean_power.low.build.power_flags=-DNRF54L15_CLEAN_POWER_LOW

generic_nrf54l15_module_36pin.menu.clean_autogate.off=Disabled (Default)
generic_nrf54l15_module_36pin.menu.clean_autogate.off.build.auto_gate_flags=

generic_nrf54l15_module_36pin.menu.clean_autogate.balanced=Balanced (2 ms idle)
generic_nrf54l15_module_36pin.menu.clean_autogate.balanced.build.auto_gate_flags=-DNRF54L15_CLEAN_AUTO_GATE=1 -DNRF54L15_CLEAN_AUTO_GATE_IDLE_US=2000

generic_nrf54l15_module_36pin.menu.clean_autogate.aggressive=Aggressive (200 us idle)
generic_nrf54l15_module_36pin.menu.clean_autogate.aggressive.build.auto_gate_flags=-DNRF54L15_CLEAN_AUTO_GATE=1 -DNRF54L15_CLEAN_AUTO_GATE_IDLE_US=200

generic_nrf54l15_module_36pin.menu.clean_ble.on=Enabled (Default)
generic_nrf54l15_module_36pin.menu.clean_ble.on.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1

generic_nrf54l15_module_36pin.menu.clean_ble.off=Disabled
generic_nrf54l15_module_36pin.menu.clean_ble.off.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=0 -DNRF54L15_CLEAN_BLE_DISABLED

generic_nrf54l15_module_36pin.menu.clean_ble_timing.interop=Interoperability (Default)
generic_nrf54l15_module_36pin.menu.clean_ble_timing.interop.build.ble_timing_flags=

generic_nrf54l15_module_36pin.menu.clean_ble_timing.balanced=Balanced Low-Power
generic_nrf54l15_module_36pin.menu.clean_ble_timing.balanced.build.ble_timing_flags=-DNRF54L15_CLEAN_BLE_TIMING_BALANCED=1

generic_nrf54l15_module_36pin.menu.clean_ble_timing.aggressive=Aggressive Low-Power
generic_nrf54l15_module_36pin.menu.clean_ble_timing.aggressive.build.ble_timing_flags=-DNRF54L15_CLEAN_BLE_TIMING_AGGRESSIVE=1

generic_nrf54l15_module_36pin.menu.clean_ble_trace.off=Disabled (Default)
generic_nrf54l15_module_36pin.menu.clean_ble_trace.off.build.ble_trace_flags=

generic_nrf54l15_module_36pin.menu.clean_ble_trace.on=Enabled
generic_nrf54l15_module_36pin.menu.clean_ble_trace.on.build.ble_trace_flags=-DNRF54L15_CLEAN_BLE_TRACE=1

generic_nrf54l15_module_36pin.menu.clean_vpr.on=Enabled (Default)
generic_nrf54l15_module_36pin.menu.clean_vpr.on.build.ldscript=nrf54l15_linker_script.ld
generic_nrf54l15_module_36pin.menu.clean_vpr.on.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=1
generic_nrf54l15_module_36pin.menu.clean_vpr.on.upload.maximum_data_size=155648

generic_nrf54l15_module_36pin.menu.clean_vpr.off=Disabled (Reclaim RAM for Non-VPR Sketches)
generic_nrf54l15_module_36pin.menu.clean_vpr.off.build.ldscript=nrf54l15_linker_script_no_vpr.ld
generic_nrf54l15_module_36pin.menu.clean_vpr.off.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=0 -DNRF54L15_CLEAN_VPR_DISABLED
generic_nrf54l15_module_36pin.menu.clean_vpr.off.upload.maximum_data_size=261632

generic_nrf54l15_module_36pin.menu.clean_zigbee.on=Enabled (Default)
generic_nrf54l15_module_36pin.menu.clean_zigbee.on.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=1

generic_nrf54l15_module_36pin.menu.clean_zigbee.off=Disabled
generic_nrf54l15_module_36pin.menu.clean_zigbee.off.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=0 -DNRF54L15_CLEAN_ZIGBEE_DISABLED

generic_nrf54l15_module_36pin.menu.clean_zigbee_channel.ch15=15 (Default)
generic_nrf54l15_module_36pin.menu.clean_zigbee_channel.ch15.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=15

generic_nrf54l15_module_36pin.menu.clean_zigbee_channel.ch11=11
generic_nrf54l15_module_36pin.menu.clean_zigbee_channel.ch11.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=11

generic_nrf54l15_module_36pin.menu.clean_zigbee_channel.ch20=20
generic_nrf54l15_module_36pin.menu.clean_zigbee_channel.ch20.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=20

generic_nrf54l15_module_36pin.menu.clean_zigbee_channel.ch25=25
generic_nrf54l15_module_36pin.menu.clean_zigbee_channel.ch25.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=25

generic_nrf54l15_module_36pin.menu.clean_zigbee_pan.pan1234=0x1234 (Default)
generic_nrf54l15_module_36pin.menu.clean_zigbee_pan.pan1234.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0x1234

generic_nrf54l15_module_36pin.menu.clean_zigbee_pan.pan1a2b=0x1A2B
generic_nrf54l15_module_36pin.menu.clean_zigbee_pan.pan1a2b.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0x1A2B

generic_nrf54l15_module_36pin.menu.clean_zigbee_pan.panbeef=0xBEEF
generic_nrf54l15_module_36pin.menu.clean_zigbee_pan.panbeef.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0xBEEF

generic_nrf54l15_module_36pin.menu.clean_thread.off=Disabled (Default)
generic_nrf54l15_module_36pin.menu.clean_thread.off.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=0 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
generic_nrf54l15_module_36pin.menu.clean_thread.off.build.thread_seam_flags=
generic_nrf54l15_module_36pin.menu.clean_thread.off.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

generic_nrf54l15_module_36pin.menu.clean_thread.stage=Experimental Stage Core (Leader/Child/Router + UDP)
generic_nrf54l15_module_36pin.menu.clean_thread.stage.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=1 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
generic_nrf54l15_module_36pin.menu.clean_thread.stage.build.thread_seam_flags=-DOPENTHREAD_CONFIG_CORE_USER_CONFIG_HEADER_ENABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/include
generic_nrf54l15_module_36pin.menu.clean_thread.stage.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

generic_nrf54l15_module_36pin.menu.clean_upload.pyocd=pyOCD (CMSIS-DAP, Default)
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.tool=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.runner=pyocd
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.use_1200bps_touch=false

