lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.runner=pyocd
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

generic_nrf54l15_module_36pin.menu.clean_upload.openocd_legacy=OpenOCD Direct (Experimental)
generic_nrf54l15_module_36pin.menu.clean_upload.openocd_legacy.upload.tool=nrf54openocd
generic_nrf54l15_module_36pin.menu.clean_upload.openocd_legacy.upload.tool.serial=nrf54openocd
generic_nrf54l15_module_36pin.menu.clean_upload.openocd_legacy.upload.runner=openocd
generic_nrf54l15_module_36pin.menu.clean_upload.openocd_legacy.upload.use_1200bps_touch=false

generic_nrf54l15_module_36pin.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.tool=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.protocol=uf2
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.runner=uf2
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.use_1200bps_touch=false
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.wait_for_upload_port=false
